//example 1
let a = 1, b = 1, c, d;
c = ++a;
alert(c);
/*
1- обЪявление переменных a=1, b=1, c и d -undefined
2 - a = a + 1= 2  Префиксный инкремент
3 - с = a = 2
4 - вывод 2
*/

//example 2
d = b++;
alert(d);
/*
5 -Постфиксный инкремент d = b = 1
6 - b = b + 1 = 2;
7 - вывод 1
*/

//example 3
c = 2 + ++a;
alert(c);
/*
8 - Префиксный инкремент a = a + 1 = 2 + 1 = 3
9 - c = 2 + 3 = 5
10 - вывод
*/

//example 4 
d = 2 + b++;
alert(d);
/*
11 - Постфиксный инкремент- d = 2 + b = 2 + 2 = 4
12 - b = b +1 = 2 + 1 = 3
13 - вывод 4
*/

//example 5 
alert(a);
alert(b);
/*
14- вывод 3
15 - вывод 3
*/